app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def new
    @task = Task.new
    @statuses = Task.statuses.keys.to_a

INSERT INTO "tasks" ("title", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "awe"], ["status", 0], ["created_at", 2016-10-16 18:22:53 UTC], ["updated_at", 2016-10-16 18:22:53 UTC]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "title" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["title", "111"], ["updated_at", 2016-10-16 22:00:31 UTC], ["id", 23]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)